results/pagination/run-0/pagination-cursor-2500.log
COMMAND: make pagination TYPE=cursor CURSOR_DEPTH_PAGES=2500 LIMIT=20

==== OUTPUT ====

k6 run \
	-e BASE_URL=http://3.39.39.25:3000/v1 \
	-e TYPE=cursor \
	-e LIMIT=20 \
	-e OFFSET= \
	-e CURSOR_DEPTH_PAGES=2500 \
	loadtest/pagination.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/pagination.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m30s max duration (incl. graceful stop):
              * pagination_load: 100.00 iterations/s for 1m0s (maxVUs: 100-300, gracefulStop: 30s)


Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

running (0m12.0s), 001/100 VUs, 65 complete and 0 interrupted iterations
pagination_load   [   1% ] 001/100 VUs  0m00.7s/1m0s  100.00 iters/s

running (0m13.0s), 001/100 VUs, 165 complete and 0 interrupted iterations
pagination_load   [   3% ] 001/100 VUs  0m01.7s/1m0s  100.00 iters/s

running (0m14.0s), 001/100 VUs, 265 complete and 0 interrupted iterations
pagination_load   [   4% ] 001/100 VUs  0m02.7s/1m0s  100.00 iters/s

running (0m15.0s), 001/100 VUs, 365 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.7s/1m0s  100.00 iters/s

running (0m16.0s), 001/100 VUs, 465 complete and 0 interrupted iterations
pagination_load   [   8% ] 001/100 VUs  0m04.7s/1m0s  100.00 iters/s

running (0m17.0s), 001/100 VUs, 565 complete and 0 interrupted iterations
pagination_load   [   9% ] 001/100 VUs  0m05.7s/1m0s  100.00 iters/s

running (0m18.0s), 001/100 VUs, 665 complete and 0 interrupted iterations
pagination_load   [  11% ] 001/100 VUs  0m06.7s/1m0s  100.00 iters/s

running (0m19.0s), 001/100 VUs, 765 complete and 0 interrupted iterations
pagination_load   [  13% ] 001/100 VUs  0m07.7s/1m0s  100.00 iters/s

running (0m20.0s), 001/100 VUs, 865 complete and 0 interrupted iterations
pagination_load   [  14% ] 001/100 VUs  0m08.7s/1m0s  100.00 iters/s

running (0m21.0s), 001/100 VUs, 965 complete and 0 interrupted iterations
pagination_load   [  16% ] 001/100 VUs  0m09.7s/1m0s  100.00 iters/s

running (0m22.0s), 001/100 VUs, 1065 complete and 0 interrupted iterations
pagination_load   [  18% ] 001/100 VUs  0m10.7s/1m0s  100.00 iters/s

running (0m23.0s), 001/100 VUs, 1165 complete and 0 interrupted iterations
pagination_load   [  19% ] 001/100 VUs  0m11.7s/1m0s  100.00 iters/s

running (0m24.0s), 001/100 VUs, 1265 complete and 0 interrupted iterations
pagination_load   [  21% ] 001/100 VUs  0m12.7s/1m0s  100.00 iters/s

running (0m25.0s), 001/100 VUs, 1365 complete and 0 interrupted iterations
pagination_load   [  23% ] 001/100 VUs  0m13.7s/1m0s  100.00 iters/s

running (0m26.0s), 001/100 VUs, 1465 complete and 0 interrupted iterations
pagination_load   [  24% ] 001/100 VUs  0m14.7s/1m0s  100.00 iters/s

running (0m27.0s), 001/100 VUs, 1565 complete and 0 interrupted iterations
pagination_load   [  26% ] 001/100 VUs  0m15.7s/1m0s  100.00 iters/s

running (0m28.0s), 001/100 VUs, 1665 complete and 0 interrupted iterations
pagination_load   [  28% ] 001/100 VUs  0m16.7s/1m0s  100.00 iters/s

running (0m29.0s), 001/100 VUs, 1765 complete and 0 interrupted iterations
pagination_load   [  29% ] 001/100 VUs  0m17.7s/1m0s  100.00 iters/s

running (0m30.0s), 001/100 VUs, 1865 complete and 0 interrupted iterations
pagination_load   [  31% ] 001/100 VUs  0m18.7s/1m0s  100.00 iters/s

running (0m31.0s), 001/100 VUs, 1965 complete and 0 interrupted iterations
pagination_load   [  33% ] 001/100 VUs  0m19.7s/1m0s  100.00 iters/s

running (0m32.0s), 001/100 VUs, 2065 complete and 0 interrupted iterations
pagination_load   [  34% ] 001/100 VUs  0m20.7s/1m0s  100.00 iters/s

running (0m33.0s), 001/100 VUs, 2165 complete and 0 interrupted iterations
pagination_load   [  36% ] 001/100 VUs  0m21.7s/1m0s  100.00 iters/s

running (0m34.0s), 001/100 VUs, 2265 complete and 0 interrupted iterations
pagination_load   [  38% ] 001/100 VUs  0m22.7s/1m0s  100.00 iters/s

running (0m35.0s), 001/100 VUs, 2365 complete and 0 interrupted iterations
pagination_load   [  39% ] 001/100 VUs  0m23.7s/1m0s  100.00 iters/s

running (0m36.0s), 001/100 VUs, 2465 complete and 0 interrupted iterations
pagination_load   [  41% ] 001/100 VUs  0m24.7s/1m0s  100.00 iters/s

running (0m37.0s), 001/100 VUs, 2565 complete and 0 interrupted iterations
pagination_load   [  43% ] 001/100 VUs  0m25.7s/1m0s  100.00 iters/s

running (0m38.0s), 001/100 VUs, 2665 complete and 0 interrupted iterations
pagination_load   [  44% ] 001/100 VUs  0m26.7s/1m0s  100.00 iters/s

running (0m39.0s), 001/100 VUs, 2765 complete and 0 interrupted iterations
pagination_load   [  46% ] 001/100 VUs  0m27.7s/1m0s  100.00 iters/s

running (0m40.0s), 001/100 VUs, 2865 complete and 0 interrupted iterations
pagination_load   [  48% ] 001/100 VUs  0m28.7s/1m0s  100.00 iters/s

running (0m41.0s), 001/100 VUs, 2965 complete and 0 interrupted iterations
pagination_load   [  49% ] 001/100 VUs  0m29.7s/1m0s  100.00 iters/s

running (0m42.0s), 001/100 VUs, 3065 complete and 0 interrupted iterations
pagination_load   [  51% ] 001/100 VUs  0m30.7s/1m0s  100.00 iters/s

running (0m43.0s), 001/100 VUs, 3165 complete and 0 interrupted iterations
pagination_load   [  53% ] 001/100 VUs  0m31.7s/1m0s  100.00 iters/s

running (0m44.0s), 001/100 VUs, 3265 complete and 0 interrupted iterations
pagination_load   [  54% ] 001/100 VUs  0m32.7s/1m0s  100.00 iters/s

running (0m45.0s), 001/100 VUs, 3365 complete and 0 interrupted iterations
pagination_load   [  56% ] 001/100 VUs  0m33.7s/1m0s  100.00 iters/s

running (0m46.0s), 001/100 VUs, 3465 complete and 0 interrupted iterations
pagination_load   [  58% ] 001/100 VUs  0m34.7s/1m0s  100.00 iters/s

running (0m47.0s), 001/100 VUs, 3565 complete and 0 interrupted iterations
pagination_load   [  59% ] 001/100 VUs  0m35.7s/1m0s  100.00 iters/s

running (0m48.0s), 001/100 VUs, 3665 complete and 0 interrupted iterations
pagination_load   [  61% ] 001/100 VUs  0m36.7s/1m0s  100.00 iters/s

running (0m49.0s), 001/100 VUs, 3765 complete and 0 interrupted iterations
pagination_load   [  63% ] 001/100 VUs  0m37.7s/1m0s  100.00 iters/s

running (0m50.0s), 001/100 VUs, 3865 complete and 0 interrupted iterations
pagination_load   [  64% ] 001/100 VUs  0m38.7s/1m0s  100.00 iters/s

running (0m51.0s), 001/100 VUs, 3965 complete and 0 interrupted iterations
pagination_load   [  66% ] 001/100 VUs  0m39.7s/1m0s  100.00 iters/s

running (0m52.0s), 001/100 VUs, 4065 complete and 0 interrupted iterations
pagination_load   [  68% ] 001/100 VUs  0m40.7s/1m0s  100.00 iters/s

running (0m53.0s), 001/100 VUs, 4165 complete and 0 interrupted iterations
pagination_load   [  69% ] 001/100 VUs  0m41.7s/1m0s  100.00 iters/s

running (0m54.0s), 001/100 VUs, 4265 complete and 0 interrupted iterations
pagination_load   [  71% ] 001/100 VUs  0m42.7s/1m0s  100.00 iters/s

running (0m55.0s), 001/100 VUs, 4365 complete and 0 interrupted iterations
pagination_load   [  73% ] 001/100 VUs  0m43.7s/1m0s  100.00 iters/s

running (0m56.0s), 001/100 VUs, 4465 complete and 0 interrupted iterations
pagination_load   [  74% ] 001/100 VUs  0m44.7s/1m0s  100.00 iters/s

running (0m57.0s), 001/100 VUs, 4565 complete and 0 interrupted iterations
pagination_load   [  76% ] 001/100 VUs  0m45.7s/1m0s  100.00 iters/s

running (0m58.0s), 001/100 VUs, 4665 complete and 0 interrupted iterations
pagination_load   [  78% ] 001/100 VUs  0m46.7s/1m0s  100.00 iters/s

running (0m59.0s), 001/100 VUs, 4765 complete and 0 interrupted iterations
pagination_load   [  79% ] 001/100 VUs  0m47.7s/1m0s  100.00 iters/s

running (1m00.0s), 001/100 VUs, 4865 complete and 0 interrupted iterations
pagination_load   [  81% ] 001/100 VUs  0m48.7s/1m0s  100.00 iters/s

running (1m01.0s), 001/100 VUs, 4965 complete and 0 interrupted iterations
pagination_load   [  83% ] 001/100 VUs  0m49.7s/1m0s  100.00 iters/s

running (1m02.0s), 001/100 VUs, 5065 complete and 0 interrupted iterations
pagination_load   [  84% ] 001/100 VUs  0m50.7s/1m0s  100.00 iters/s

running (1m03.0s), 001/100 VUs, 5165 complete and 0 interrupted iterations
pagination_load   [  86% ] 001/100 VUs  0m51.7s/1m0s  100.00 iters/s

running (1m04.0s), 001/100 VUs, 5265 complete and 0 interrupted iterations
pagination_load   [  88% ] 001/100 VUs  0m52.7s/1m0s  100.00 iters/s

running (1m05.0s), 001/100 VUs, 5365 complete and 0 interrupted iterations
pagination_load   [  89% ] 001/100 VUs  0m53.7s/1m0s  100.00 iters/s

running (1m06.0s), 001/100 VUs, 5465 complete and 0 interrupted iterations
pagination_load   [  91% ] 001/100 VUs  0m54.7s/1m0s  100.00 iters/s

running (1m07.0s), 001/100 VUs, 5565 complete and 0 interrupted iterations
pagination_load   [  93% ] 001/100 VUs  0m55.7s/1m0s  100.00 iters/s

running (1m08.0s), 001/100 VUs, 5665 complete and 0 interrupted iterations
pagination_load   [  94% ] 001/100 VUs  0m56.7s/1m0s  100.00 iters/s

running (1m09.0s), 001/100 VUs, 5765 complete and 0 interrupted iterations
pagination_load   [  96% ] 001/100 VUs  0m57.7s/1m0s  100.00 iters/s

running (1m10.0s), 001/100 VUs, 5865 complete and 0 interrupted iterations
pagination_load   [  98% ] 001/100 VUs  0m58.7s/1m0s  100.00 iters/s

running (1m11.0s), 001/100 VUs, 5965 complete and 0 interrupted iterations
pagination_load   [  99% ] 001/100 VUs  0m59.7s/1m0s  100.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=4.97ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8500    119.169591/s
    checks_succeeded...: 100.00% 8500 out of 8500
    checks_failed......: 0.00%   0 out of 8500

    ✓ setup status is 200
    ✓ status is 200

    HTTP
    http_req_duration..............: avg=4.47ms min=3.7ms  med=4.41ms max=18.45ms p(90)=4.83ms p(95)=4.97ms
      { expected_response:true }...: avg=4.47ms min=3.7ms  med=4.41ms max=18.45ms p(90)=4.83ms p(95)=4.97ms
    http_req_failed................: 0.00%  0 out of 8500
    http_reqs......................: 8500   119.169591/s

    EXECUTION
    iteration_duration.............: avg=4.65ms min=3.88ms med=4.58ms max=18.54ms p(90)=5.01ms p(95)=5.22ms
    iterations.....................: 6000   84.119711/s
    vus............................: 0      min=0         max=1  
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 34 MB  474 kB/s
    data_sent......................: 918 kB 13 kB/s



running (1m11.3s), 000/100 VUs, 6000 complete and 0 interrupted iterations
pagination_load ✓ [ 100% ] 000/100 VUs  1m0s  100.00 iters/s